In [23]:
import pandas as pd
df2= {'Team':['Riders','Riders','Devils','Devils','Kings','Kings','Kings','Kings','Riders','Royals','Royals','Royals','Rcb'],
            'Rank':[1,2,2,3,3,4,1,1,2,4,1,2,1],
            'Year':[2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017,2018],
            'Points':[876,789,863,673,741,812,756,788,694,701,884,690,918],
            
           }
df=pd.DataFrame(df2)
df

      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
2   Devils     2  2014     863
3   Devils     3  2015     673
4    Kings     3  2014     741
5    Kings     4  2015     812
6    Kings     1  2016     756
7    Kings     1  2017     788
8   Riders     2  2016     694
9   Royals     4  2014     701
10  Royals     1  2015     884
11  Royals     2  2017     690
12     Rcb     1  2018     918

In [24]:
df.shape

(13, 4)

In [25]:
df.columns

Index(['Team', 'Rank', 'Year', 'Points'], dtype='object')

In [26]:
df["Team"].unique()

array(['Riders', 'Devils', 'Kings', 'Royals', 'Rcb'], dtype=object)

In [27]:
df["Team"].nunique()

5

In [28]:
r=df.groupby("Team")["Points"]
r

In [29]:
r.value_counts()

Team    Points
Devils  673       1
        863       1
Kings   741       1
        756       1
        788       1
        812       1
Rcb     918       1
Riders  694       1
        789       1
        876       1
Royals  690       1
        701       1
        884       1
Name: count, dtype: int64

In [30]:
r.sum()

Team
Devils    1536
Kings     3097
Rcb        918
Riders    2359
Royals    2275
Name: Points, dtype: int64

In [31]:
# Har team ke kitne records (rows) hain?
df["Team"].value_counts()

Team
Kings     4
Riders    3
Royals    3
Devils    2
Rcb       1
Name: count, dtype: int64

In [32]:
# Dataset me unique years kaun-kaun se hain?
df["Year"].unique()

array([2014, 2015, 2016, 2017, 2018])

In [33]:
# Dataset me minimum points aur maximum points kya hain?
print(df["Points"].min())
print(df["Points"].max())

673
918

In [34]:
# Dataset ka average (mean) points kya hai?
["Points"].mean()

AttributeError: 'list' object has no attribute 'mean'

In [35]:
# Kaunsi team ne sabse zyada points score kiye hain (single record me)?
df[["Team","Points"]].max()

Team      Royals
Points       918
dtype: object

In [36]:
# Kaunsa year me sabse zyada matches / records hain?
df["Team"].value_counts().head(1)

Team
Kings    4
Name: count, dtype: int64

In [37]:
# Dataset me Rank = 1 wale kitne records hain?
df[df["Rank"]==1]

      Team  Rank  Year  Points
0   Riders     1  2014     876
6    Kings     1  2016     756
7    Kings     1  2017     788
10  Royals     1  2015     884
12     Rcb     1  2018     918

In [38]:
# Points aur Rank column ka data type kya hai?
print(df["Points"].dtype)
print(df["Rank"].dtype)

int64
int64

In [39]:
# Kya dataset me missing values hain?
df.isnull().sum()

Team      0
Rank      0
Year      0
Points    0
dtype: int64

In [40]:
# Dataset ko first 5 rows aur last 5 rows me dikhao.
print(df.head()) # first 5 row
print(df.tail())  # last 5 row

     Team  Rank  Year  Points
0  Riders     1  2014     876
1  Riders     2  2015     789
2  Devils     2  2014     863
3  Devils     3  2015     673
4   Kings     3  2014     741
      Team  Rank  Year  Points
8   Riders     2  2016     694
9   Royals     4  2014     701
10  Royals     1  2015     884
11  Royals     2  2017     690
12     Rcb     1  2018     918

In [41]:
# Dataset ko Year ke ascending order me sort karo.
df.sort_values(by="Year",ascending=False)

      Team  Rank  Year  Points
12     Rcb     1  2018     918
7    Kings     1  2017     788
11  Royals     2  2017     690
6    Kings     1  2016     756
8   Riders     2  2016     694
1   Riders     2  2015     789
3   Devils     3  2015     673
5    Kings     4  2015     812
10  Royals     1  2015     884
0   Riders     1  2014     876
2   Devils     2  2014     863
4    Kings     3  2014     741
9   Royals     4  2014     701

In [42]:
# Sirf Riders team ka data filter karke dikhao.
df[df["Team"]=="Riders"]

     Team  Rank  Year  Points
0  Riders     1  2014     876
1  Riders     2  2015     789
8  Riders     2  2016     694

In [43]:
# Har team ke total points calculate karo.
df.groupby("Team")["Points"].sum()

Team
Devils    1536
Kings     3097
Rcb        918
Riders    2359
Royals    2275
Name: Points, dtype: int64

In [46]:
# Har team ka average (mean) points nikaalo.
df.groupby("Team")["Points"].mean()

Team
Devils    768.000000
Kings     774.250000
Rcb       918.000000
Riders    786.333333
Royals    758.333333
Name: Points, dtype: float64